In [1]:
pop={"nevada":{2001:2.4,2002:2.9},"ohio":{2000:1.5,2000:1.7,2002:3.6}}

In [4]:
import pandas as pd
import numpy as np

In [5]:
frame3=pd.DataFrame(pop)

In [6]:
frame3

      nevada  ohio
2001     2.4   NaN
2002     2.9   3.6
2000     NaN   1.7

In [7]:
frame3.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     NaN   3.6   1.7

In [8]:
frame3.values

array([[2.4, nan],
       [2.9, 3.6],
       [nan, 1.7]])

In [11]:
frame4=pd.DataFrame([[1,2,3,4,5],[4,5,6,7,8]])

In [13]:
frame4.index=["one","two"]

In [14]:
frame4

     0  1  2  3  4
one  1  2  3  4  5
two  4  5  6  7  8

In [15]:
frame4.columns=["one","two","three","four","five"]

In [17]:
frame4

     one  two  three  four  five
one    1    2      3     4     5
two    4    5      6     7     8

In [18]:
obj=pd.Series(np.arange(5),index=["a","b","c","d","e"])

In [19]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [20]:
obj.drop("c")

a    0
b    1
d    3
e    4
dtype: int32

In [21]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [22]:
obj.drop(["a","c"])

b    1
d    3
e    4
dtype: int32

In [24]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=["ohio","colorado","utah","new york"],columns=["one","two","three","four"])

In [25]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [26]:
data.drop(["ohio","utah"])

          one  two  three  four
colorado    4    5      6     7
new york   12   13     14    15

In [28]:
data.drop(["one","two"],axis=1)

          three  four
ohio          2     3
colorado      6     7
utah         10    11
new york     14    15

In [30]:
obj.drop("c",inplace=True)

In [31]:
obj

a    0
b    1
d    3
e    4
dtype: int32

In [34]:
obj=pd.Series(np.arange(4),index=["a","b","c","d"])

In [35]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [36]:
obj["c"]

2

In [38]:
obj[["c","d"]]

c    2
d    3
dtype: int32

In [39]:
obj[1]

1

In [41]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [42]:
obj[obj<2]

a    0
b    1
dtype: int32

In [43]:
obj["b":"c"]

b    1
c    2
dtype: int32

In [45]:
obj["b":"c"]=15

In [46]:
obj

a     0
b    15
c    15
d     3
dtype: int32

In [51]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=["ohio","colorado","utah","new york"],columns=["one","two","three","four"])

In [52]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [53]:
data["two"]

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int32

In [ ]:
s2=p